-- phpMyAdmin SQL Dump
-- version 4.0.10.10
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Фев 16 2016 г., 16:45
-- Версия сервера: 5.5.45
-- Версия PHP: 5.3.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `sberkassa`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cashflows`
--

CREATE TABLE IF NOT EXISTS `cashflows` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `idaccount` int(10) unsigned NOT NULL,
  `datetimeop` datetime NOT NULL,
  `accepted` decimal(10,2) NOT NULL,
  `monebalance` decimal(10,2) NOT NULL,
  `moneytype` varchar(255) NOT NULL,
  `%` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `clients`
--

CREATE TABLE IF NOT EXISTS `clients` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `surname` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `patronymic` varchar(255) NOT NULL,
  `floor` varchar(255) NOT NULL,
  `birthdate` date NOT NULL,
  `passportdata` text NOT NULL,
  `addressdata` text NOT NULL,
  `contactphone` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=23 ;

--
-- Дамп данных таблицы `clients`
--

INSERT INTO `clients` (`id`, `surname`, `name`, `patronymic`, `floor`, `birthdate`, `passportdata`, `addressdata`, `contactphone`) VALUES
(1, 'Ошарина', 'Елена', 'Петровна', 'Жен.', '1969-03-10', '1203 810241 ОВД Ленинского р-на г.Астрахани 30.08.2003', 'ул. Профессора Попова, д.32, кв.11', '+7(920) 547-82-35'),
(2, 'Черепанская', 'Ирина', 'Анатольевна', 'Жен.', '1966-11-22', '1201 13935 ОВД Ленинского р-НА 20.07.2001', 'ул. Мельничная, д.18, кв.23', '+7(980) 345-71-23'),
(3, 'Гринько', 'Светлана', 'Ивановна', 'Жен.', '1953-09-16', '1201 251795 017678 Советским РОВД гор.Астрахани 04.12.2001 кп 302-006', ' ул.  Петергофское шоссе, д.47, кв.43', '+7(670) 345-43-13'),
(4, 'Кудинова', 'Анна', 'Михайловна', 'Жен.', '1978-12-04', '1210 357264 ОУФМС России по АО в Ленинском р-на 19.01.11', 'ул. Магнитогорская д.51, кв.57', '+7(670) 346-41-12'),
(5, 'Сычев', 'Павел', 'Иванович', 'Муж.', '1953-04-06', '1211388507 ОУФМС России по АО в Ленинском р-на 18.11.2011 кп 300-002', 'Нижний Новгород, пр. Гагарина, д.65, кв.12', '+7(910) 456-41-23'),
(6, 'Корчунов', 'Дмитрий', 'Викторович', 'Муж.', '1981-01-11', '1203701272 ОВД Камызякского р-на АО 26.05.2003', 'Ленинский пр., д.81, кв.55', '+7(920) 457-48-32'),
(7, 'Лосеева', 'Юлия', 'Николаевна', 'Жен.', '1992-07-05', '1207172986 ОУФМС России по АО', ' ул. Коли Томчака д. 12/14, кв.44', '+7(955) 123-43-46'),
(8, 'Курилов', 'Валерий', 'Александрович', 'Муж.', '1970-01-08', '1299 054539 ПВС Кировского РОВД 24.05.2000', 'ул. Шателена, д.26, кв.65', '+7(908) 234-12-43'),
(9, 'Шевченко', 'Марина', 'Александровна', 'Жен.', '1963-10-22', '1208 221240 ОУФМС России в Ленинском р-не г.Астрахань 24.10.2008 кп 300-002', 'ул. Героя Быкова, д.10, кв.68', '+7(930) 481-21-21'),
(10, 'Тимофеев', 'Вячеслав', 'Павлович', 'Муж.', '1942-08-13', '1201 226568 Советским РОВД гор Астрахань 06.11.2011г. кп 302-005', ' ул.  Верхне-Печёрская, д.1, кв.55', '+7(960) 385-19-41'),
(11, 'Ершов', 'Александр', 'Викторович', 'Муж.', '1979-08-06', '1201178649 Кировским РОВД г.Астрахань 23.08.2001 кп302-001', ' ул. Ткачей д.46, кв.123', '+7(960) 234-55-47'),
(12, 'Поляков', 'Анатолий', 'Сергеевич', 'Муж.', '1979-08-06', '1202 504793 ОВД Ленинский р-на 04.10.2002 кп 302-007', 'Кондратьевский пр. д.15А, кв.48', '+7(945) 645-64-56'),
(13, 'Косарева', 'Ольга', 'Вячеславовна', 'Жен.', '1965-10-22', '1210 345518 ОУФМС России по АО в Трусовском р-не г. Астрахани 13.11.2010 кп 300-004', 'ул. Заслонова, д.47, кв.36', '+7(965) 357-14-64'),
(14, 'Курянова', 'Наталья', 'Алексеевна', 'Жен.', '1956-01-27', '1201 181797 Трусовским РОВД г.Астрахани 28.08.2001 кп 402-010', 'ул. 1-ая Молодежная, д.23, кв.18', '+7(908) 514-93-45'),
(15, 'Корнилов', 'Николай', 'Павлович', 'Муж.', '2006-05-05', 'I-KB №607399 Отдел ЗАГС Ленинского р-на г.Астрахани', 'ул. Студенческая, д.52, кв.51', '+7(920) 456-73-49'),
(16, 'Гранкин', 'Александр', 'Павлович', 'Муж.', '1976-11-02', '1203746728 ОВД Ленинского р-на гор.Астрахань 28.06.2003 КП 302-007', 'ул. Тухачевского, д.93, кв.61', '+7(940) 471-73-81'),
(17, 'Хохлов', 'Семен', 'Валерьевич', 'Муж.', '2005-10-12', '1204 963821 Советским РОВД г.Астрахани 29.03.2005', '16-й микрорайон, д.1, кв. 89', '+7(940) 149-13-51'),
(18, 'Лебедев', 'Иван', 'Александрович', 'Муж.', '2004-08-30', 'I-KB 587240 ОЗАГС Трусовского р-на г.Астрахани', ' ул. Поповича, д.13, кв.41', '+7(920) 123-12-31'),
(19, 'Арбузова', 'Наталия', 'Викторовна', 'Жен.', '1956-08-03', '1202326185 ОВД Ленинского р-на 21 02.2002 КП 302-007', ' пр-т Московский, д.16, кв.3', '+7(923) 427-83-45'),
(20, 'Бунин', 'Вадим', 'Семенович', 'Муж.', '1947-02-16', '1202 522457 Икрянинским РОВД Астр.обл.04.11.2002г.', 'бульвар Космонавтов, 97', '+7(918) 568-51-23'),
(21, 'Иванов', 'Николай', 'Иванович', 'Муж.', '1971-11-05', '1705 963821 Московского РОВД г.Астрахани 29.03.2000', 'ул. Ульяновская, д.60', '+7(940) 847-52-31'),
(22, 'Васильев', 'Константин', 'Иванович', 'Муж.', '1975-04-24', '2302 304596 071876 Московским РОВД гор.Нижнего Новгорода 01.06.2002 кп 302-006', ' ул. Наконечникова, д.17, корп. 3, кв.91', '+7(965) 080-65-94');

-- --------------------------------------------------------

--
-- Структура таблицы `savingsaccount`
--

CREATE TABLE IF NOT EXISTS `savingsaccount` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `idclient` int(11) NOT NULL,
  `deposittype` varchar(255) NOT NULL,
  `moneytype` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=12 ;

--
-- Дамп данных таблицы `savingsaccount`
--

INSERT INTO `savingsaccount` (`id`, `idclient`, `deposittype`, `moneytype`) VALUES
(1, 10, 'До востребования', 'RUB'),
(2, 9, 'До востребования', 'EUR'),
(3, 12, 'До востребования', 'RUB'),
(4, 21, 'Срочный', 'RUB'),
(5, 14, 'До востребования', 'RUB'),
(6, 4, 'Срочный', 'RUB'),
(7, 9, 'Срочный', 'USD'),
(8, 20, 'До востребования', 'EUR'),
(9, 7, 'Срочный', 'USD'),
(10, 6, 'До востребования', 'EUR'),
(11, 22, 'Срочный', 'RUB');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
